import { Model } from 'mongoose';
import Product from '../model/product';

const defaultProducts = [
  {
    title: 'מיתרים לגיטרה חשמלית אליקסיר – 9-42 – Elixir OPTIWEB 19002 Nickel Plated Steel',
    // subtitle: '',
    description:
      'סט מסדרת Optiweb, מיתרים בעלי סאונד בהיר במיוחד, מצופים בשילוב ניקל עם הנוסחה הייחודית של Elixir. למתן תחושה טבעית ונוחה, ולמניעת הצטברות קורוזיה והארכה משמעותית של חיי המיתר, תוך שמירה על איכויות צליל גבוהות.',
    imageUrl:
      'https://musicmart-il-wp-assets.fra1.cdn.digitaloceanspaces.com/app/uploads/2018/12/10021744/19002-1-400x400.jpg',
    daysToDeliver: 7,
    price: 59,
    stockStatus: true,
  },
  {
    title: ' מיתרים לגיטרה חשמלית אליקסיר – 9-42 – Elixir 12002 NANOWEB Nickel Plated Steel',
    description:
      'סט מסדרת ה-Nanoweb, מיתרים בעלי סאונד בהיר, מצופים בשכבה דקה במיוחד של הנוסחה הייחודית של Elixir. למניעת הצטברות קורוזיה והארכת חיי המיתר, תוך שמירה על איכויות צליל גבוהות.',
    imageUrl:
      'https://musicmart-il-wp-assets.fra1.cdn.digitaloceanspaces.com/app/uploads/2018/12/10021740/12002-1-400x400.jpg',
    daysToDeliver: 7,
    price: 49,
    stockStatus: true,
  },
  {
    title: 'מגבר לגיטרה חשמלית אורנג’- ORANGE CRUSH 20 Electric Guitar Amplifier',
    description: `מגבר אורנג’ קראש 20 לגיטרה חשמלית Orange Crush 20 הוא מגבר שני ערוצים, המציע גישה חסרת פשרות לאיכות צליל, תוך שמירה על גודל נוח לנשיאה. מצבי קלין ודיסטורשן הניתנים לברירה על ידי פדאל פוטסוויץ’, ופרה אמפ המציע פלטה רחבה של אפשרויות סאונד ועושר רב באוברטונים. 

    הפרה אמפ מציע מגוון מעורר השראה של טונים מורכבים ועשירים, שיתאימו לכל נגן בכל סגנון ויאפשרו לו/ה להתאים אישית את הסאונד כך שישראל את המוזיקה באופן הטוב ביותר.
    
     
    
    רמקול בוטיק 8″ של החברה שומר על האיכות והדיוק של כל צליל, בעוד חיבור aux ויציאת אוזניות חדשנית הופכים אותו יחדיו למגבר האימון והחללים הקטנים האולטימטיבי עבור אלו המחפשים את סאונד אורנג’ האגדי. 
    
    אורנג’ הביאה לכדי אומנות את חשיבות המעגל האנלוגי בעידן הדיגיטלי, ומגברי הקראש של החברה מציעים את הסאונד החי,התגובתי והממכר של אורנג’, שמעוררים השראה בכל נגן להתמקד בגיטרה ובמוזיקה עצמה, ולא בטכנולוגיה המטשטשת מסביב. המגברים מציעים טווח סאונד רחב וכמעט אינסופי של דיוק הצליל והיום כך שיתאים לכל אחד/ת ולכל סגנון.
    
    יציאת האוזניות המאפשרת אימון שקט או חיבור ישיר למיקסר, ומשחזרת באופן מדויק את אופי המגבר לו היו משתמשים במיקרופונים להגברתו.
    
    הרמקול הייחודי של החברה מביא את האיזון המושלם בין הוינטאג’ למודרני, ובין התדרים הנמוכים לגבוהים, בעוד העיצוב ההיסטורי (והכתום!) של החברה מבטיח את שיא הסטייל, בין אם בסטודיו או על הבמה.`,
    imageUrl:
      'https://musicmart-il-wp-assets.fra1.cdn.digitaloceanspaces.com/app/uploads/2020/10/14163910/crush-20a-400x400.jpg',
    daysToDeliver: 10,
    price: 599,
    stockStatus: true,
  },
  {
    title: 'מגבר לגיטרה חשמלית אורנג’- ORANGE CRUSH 35RT Electric Guitar Amplifier',
    description: `מגבר אורנג’ קראש 35RT הוא המגבר הגדול והעוצמתי ביותר בסדרת הקראש של החברה. מגבר שני ערוצים בעל פרהאמפ בגיין גבוה, 35Watt ורמקול 10″, המספק תוצאות מרהיבות, בווליום רב, ובנוכחות יוצאת דופן. המגבר כולל ריוורב וטיונר כרומטי מובנה, נוסף על חיבור אוזניות וחיבור Aux לשכלול האימון או ההופעה שלך. . 

    מעל כל זה, המגבר מיועד לשרשורי אפקטים רחבים ככל האפשר ובנוי להוציא את המיטב מאפשרויות הצליל והסטאפ האישי של כל נגן.ית גיטרה. המגבר הזה ייקח כל אחד הרבה מעבר למה ששאר מגברי האימון המצויים מסוגלים לעשות, והוא מתאים גם להופעות קטנות והקלטות כמובן. 
    
    אורנג’ הביאה לכדי אומנות את חשיבות המעגל האנלוגי בעידן הדיגיטלי, ומגברי הקראש של החברה מציעים את הסאונד החי,התגובתי והממכר של אורנג’, שמעוררים השראה בכל נגן להתמקד בגיטרה ובמוזיקה עצמה, ולא בטכנולוגיה המטשטשת מסביב. המגברים מציעים טווח סאונד רחב וכמעט אינסופי של דיוק הצליל והיום כך שיתאים לכל אחד/ת ולכל סגנון.
    
    יציאת האוזניות המאפשרת אימון שקט או חיבור ישיר למיקסר, ומשחזרת באופן מדויק את אופי המגבר לו היו משתמשים במיקרופונים להגברתו.
    
    הרמקול הייחודי של החברה מביא את האיזון המושלם בין הוינטאג’ למודרני, ובין התדרים הנמוכים לגבוהים, בעוד העיצוב ההיסטורי (והכתום!) של החברה מבטיח את שיא הסטייל, בין אם בסטודיו או על הבמה.`,
    imageUrl:
      'https://musicmart-il-wp-assets.fra1.cdn.digitaloceanspaces.com/app/uploads/2020/10/14165735/crush-35rt-400x400.jpg',
    daysToDeliver: 10,
    price: 1250,
    stockStatus: true,
  },
];

export default defaultProducts;
